@extends('layouts.app')

@section('content')
    <h4>Де дивитися український ефір, слухати радіо та читати новини</h4>
    <p>Що робити, якщо немає українського ефірного мовлення:</p>
    <p>
        <i class="bi bi-youtube"></i> Провідні канали України об'єдналися та ведуть єдиний цілодобовий інформаційний марафон (#UAразом).
        Прямий ефір можна дивитися на Youtube (обирай будь-який):
        <ul>
            <li><a href="https://www.youtube.com/watch?v=CwQl49tDPTk" target="_blank">Телеканал Рада. Прямий ефір</a></li>
            <li><a href="https://www.youtube.com/watch?v=lhs2JS_f9bI" target="_blank">Телеканал 1+1 онлайн. Спільний телемарафон #UAразом</a></li>
            <li><a href="https://www.youtube.com/watch?v=A-6hKtEp99c" target="_blank">Росія напала на Україну / Факти ICTV онлайн / Новини України зараз / Обстріли України</a></li>
            <li><a href="https://www.youtube.com/watch?v=IgSn1Z2rq6E" target="_blank">Україна 24 онлайн / Украина 24 онлайн. Прямий ефір</a></li>
            <li><a href="https://www.youtube.com/watch?v=ATjlRUA3tsY" target="_blank">Новости Украины на русском языке в прямом эфире - Марафон #UA_вместе</a> (поширюйте родичам та друзям з Росії)</li>
        </ul>
    </p>
    <p>Інші джерела та регіональні новини:</p>
    <ul>
        <li>
            <a href="https://viyna.net/9ac9be3cc98f4ec78e00b7a7efd556b9" target="_blank">Більше варіантів (інші мови, формати)</a>
        </li>
        <li>
            <a href="https://viyna.net/66823f92dccd4da0aaa492e78669da4e" target="_blank">Новини по містах та областях</a>
        </li>
    </ul>
    <p><i class="bi bi-telegram"></i> Різноманітні Telegram-канали:</p>
    <ul>
        <li><a href="https://t.me/suspilnenews" target="_blank">СУСПІЛЬНЕ НОВИНИ</a></li>
        <li><a href="https://t.me/objectivetv" target="_blank">Объектив - новости</a></li>
        <li><a href="https://t.me/verkhovna_rada_ua_zmi" target="_blank">Верховна Рада ЗМІ</a></li>
        <li><a href="https://t.me/myalgorhythm" target="_blank">Алгоритм | Україна переможе 🇺🇦</a></li>
        <li><a href="https://t.me/ssternenko" target="_blank">STERNENKO</a> (війсковий)</li>
        <li><a href="https://t.me/afi_12" target="_blank">Арія механічного соловейка</a> (волонтерка)</li>
    </ul>
    <p>Інформація нижче з Держспецзв'язку: <a href="https://t.me/verkhovnaradaukrainy/12772" target="_blank">джерело</a> (Telegram)</p>
    <p>
        💻📱 Якщо не працює українське ефірне телебачення, слідкувати за новинами можна на Youtube,
        в <a href="https://diia.gov.ua/" target="_blank">Дії</a>
        та ОТТ-платформах -
        <a href="https://youtv.ua/" target="_blank">YouTV</a>,
        <a href="https://sweet.tv/ru" target="_blank">Sweet TV</a>,
        <a href="https://omegatv.ua/" target="_blank">Omega TV</a>,
        <a href="https://megogo.net/" target="_blank">MEGOGO</a>,
        <a href="https://tv.kyivstar.ua/" target="_blank">Kyivstar TV</a>,
        <a href="https://oll.tv/" target="_blank">Oll tv</a>.
        В Дії та в безкоштовному інтернет-приймачі <a href="https://radioplayer.ua/" target="_blank">radioplayer.ua</a> мовить українське радіо.
        <a href="https://viyna.net/4679d44cb6b74bd3bc742af7a8cfb61b" target="_blank">Завантажити ці програми до смартфону</a>.
    </p>
    <p>
        📡 Якщо доступу до інтернету немає, дивитись телебачення безкоштовно можна на супутнику, адже сигнал було розкодовано в перші дні війни.
        Для цього достатньо супутникової антени та супутникового ресивера.
    </p>
    <p>
        📻 Ті, у кого немає ані обладнання для отримання сигналу з супутника, ані інтернету, все одно можуть слухати українське радіо.
        Для цього достатньо старих приймачів, які працюють на середніх хвилях. Ловіть сигнал у 1278, 1404, 873 та 657 кГц.
    </p>
@endsection
